// Текстове поле (input) - nickname. Якщо хоч одна умова не виконується, додати червону рамку цьому текстовому полю, умови:
// довжина мінімум 3 символа (включно), максимум 24 символа (включно)
// мінімум 1 буква
// За допомогою JavaScript дозвольте вводити тільки букви (англійські)  і цифри.

// Текстове поле (input) - name. Якщо хоч одна умова не виконується, додати червону рамку цьому текстовому полю, умови:
// довжина мінімум 1(включно), максимум 100 (включно)
// За допомогою JavaScript дозвольте вводити тільки букви (англійські).

// Текстове поле (textarea) - comment:
// довжина мінімум 1 (включно),  максимум 1000(включно)
// За допомогою JavaScript дозвольте вводити тільки букви (англійські), а також наступні символи .,!?- і пробіли.

// 4. Кнопка “Add comment”:
// додає блок з коментарем у наступному форматі:
// 	nickname - name
// 	comment
// додати блок з коментарем можна тільки тоді коли всі поля заповнені і відповідають попередньо описаним вимогам
// якщо поля не заповнені, то кнопка має бути виключена (disabled)
// блок з коментарем додає на початку списку коментарів
// Спочатку логіка, потім оформлення за бажанням.
